Repository: AOSC-Tracking/debian-kernel-team-linux
Catalog: debian/po/*.po
Languages: sk

source: Update disk device IDs in system configuration?
sk: Aktualizova?? ID diskov??ch zariaden?? v nastaven?? syst??mu?

source: The new Linux kernel version provides different drivers for some PATA (IDE) controllers. The names of some hard disk, CD-ROM, and tape devices may change.
sk: Nov?? verzia Linuxov??ho jadra poskytuje in?? ovl??da??e niektor??ch radi??ov PATA (IDE). N??zvy niektor??ch pevn??ch diskov, CD-ROM a p??skov??ch mechan??k sa m????u zmeni??.

source: It is now recommended to identify disk devices in configuration files by label or UUID (unique identifier) rather than by device name, which will work with both old and new kernel versions.
sk: V s????asnosti je odpor????an?? identifikova?? diskov?? zariadenia v konfigura??n??ch s??boroch pomocou ich menovky alebo UUID (jedine??n?? identifik??tor), namiesto mena zariadenia, ktor?? je funk??n?? ako so star??mi, tak i s nov??mi verziami jadra.

source: If you choose to not update the system configuration automatically, you must update device IDs yourself before the next system reboot or the system may become unbootable.
sk: Ak si vyberiete neaktualizova?? nastavenia syst??mu automaticky, mus??te ID zaraden?? upravi?? manu??lne, e??te pred nasleduj??cim re??tartom syst??mu, inak sa syst??m nemus?? zavies??.

source: Apply configuration changes to disk device IDs?
sk: Pou??i?? zmeny nastavenia ID diskov??ch zariaden???

source: These devices will be assigned UUIDs or labels:
sk: T??mto zariadeniam bude priraden?? UUID alebo menovka:

source: These configuration files will be updated:
sk: Tieto konfigura??n?? s??bory bud?? aktualizovan??:

source: The device IDs will be changed as follows:
sk: ID zariaden?? bud?? zmenen?? takto:

source: Configuration files still contain deprecated device names
sk: Konfigura??n?? s??bory st??le obsahuj?? zastaran?? men?? zariaden??

source: The following configuration files still use some device names that may change when using the new kernel:
sk: Nasleduj??ce konfigura??n?? s??bory st??le pou????vaj?? men?? zariaden??, ktor?? asi bude treba pri pou??it?? nov??ho jadra zmeni??:

source: Boot loader configuration check needed
sk: Je nutn?? kontrola nastavenia zav??dza??a

source: The boot loader configuration for this system was not recognized. These settings in the configuration may need to be updated:
sk: Nastavenie zav??dza??a tohoto syst??mu nebolo rozpoznan??. Tieto nastavenia v konfigur??cii asi bude treba aktualizova??:

source: * The root device ID passed as a kernel parameter; * The boot device ID used to install and update the boot loader.
sk: * ID kore??ov??ho zariadenia predan?? ako parameter jadra; * ID zav??dzacieho zariadenia, pou??it??ho na in??tal??ciu a aktualiz??ciu zav??dza??a.

source: You should generally identify these devices by UUID or label. However, on MIPS systems the root device must be identified by name.
sk: Tieto zariadenia by ste mali ozna??ova?? ich UUID ??i menovkou. Na syst??moch MIPS v??ak mus?? by?? kore??ov?? zariadenie ozna??en?? menom.

source: Boot loader may need to be upgraded
sk: Zav??dza?? mo??no vy??aduje aktualiz??ciu

source: Kernel packages no longer update a default boot loader.
sk: Bal??ky jadra u?? neaktualizuj?? predvolen?? zav??dza??.

source: If the boot loader needs to be updated whenever a new kernel is installed, the boot loader package should install a script in /etc/kernel/postinst.d. Alternately, you can specify the command to update the boot loader by setting the 'postinst_hook' variable in /etc/kernel-img.conf.
sk: Ak je potrebn?? aktualizova?? zav??dza?? pri ka??dej in??tal??cii nov??ho jadra, mus?? zav??dza?? nain??talova?? skript do /etc/kernel/postinst.d. Pr??padne m????ete zada?? pr??kaz na aktualiz??ciu zav??dza??a nastaven??m premennej ???postinst_hook??? v /etc/kernel-img.conf.

source: Abort installation after depmod error?
sk: Preru??i?? in??tal??ciu po chybe depmod?

source: The 'depmod' command exited with the exit code ${exit_value} (${SIGNAL}${CORE}).
sk: Pr??kaz ???depmod??? skon??il s n??vratov??m k??dom ${exit_value} (${SIGNAL}${CORE}).

source: Since this image uses initrd, the ${modules_base}/=V/modules.dep file will not be deleted, even though it may be invalid.
sk: Ke????e tento obraz pou????va initrd, nebude s??bor ${modules_base}/=V/modules.dep zmazan??, hoci m????e by?? neplatn??.

source: You should abort the installation and fix the errors in depmod, or regenerate the initrd image with a known good modules.dep file. If you don't abort the installation, there is a danger that the system will fail to boot.
sk: Mali by ste preru??i?? in??tal??ciu a opravi?? chyby v depmod, alebo znova vytvori?? obraz initrd s funk??n??m s??borom modules.dep. Ak teraz nepreru????te in??tal??ciu, m????e sa sta??, ??e sa nepodar?? zavies?? syst??m.

source: Abort kernel removal?
sk: Preru??i?? odstra??ovanie jadra?

source: You are running a kernel (version ${running}) and attempting to remove the same version.
sk: Pok????ate sa odstr??ni?? rovnak?? verziu jadra, ak?? pr??ve pou????vate (version ${running}).

source: This can make the system unbootable as it will remove /boot/vmlinuz-${running} and all modules under the directory /lib/modules/${running}. This can only be fixed with a copy of the kernel image and the corresponding modules.
sk: Toto m????e sp??sobi??, ??e sa syst??m nezavedie, preto??e bude odstr??nen?? /boot/vmlinuz-${running} a v??etky moduly z adres??ra /lib/modules/${running}. Opraven?? to m????e by?? len prekop??rovan??m obrazu jadra a pr??slu??n??ch modulov.

source: It is highly recommended to abort the kernel removal unless you are prepared to fix the system after removal.
sk: Je ve??mi odpor????an?? preru??i?? odstra??ovanie jadra, pokia?? nie ste pripraven?? na opravu syst??mu po jeho odstr??nen??.

source: Required firmware files may be missing
sk: Vy??adovan?? s??bory s firmware m????u ch??ba??

source: This system is currently running Linux ${runningversion} and you are installing Linux ${version}. In the new version some of the drivers used on this system may require additional firmware files:
sk: Tento syst??m pr??ve pou????va Linux ${runningversion} a vy in??talujete Linux ${version}. V novej verzii m????u niektor?? ovl??da??e pou????van?? t??mto syst??mom vy??adova?? dodato??n?? s??bory s firmware:

source: Most firmware files are not included in the system because they do not conform to the Debian Free Software Guidelines. You may need to reconfigure the package manager to include the contrib and non-free sections of the package archive before you can install these firmware files.
sk: V??????ina s??borov s firmware nie je v syst??me zahrnut??, preto??e nie s?? v s??lade so Z??sadami slobodn??ho softv??ru Debianu. Pred in??tal??ciou t??chto s??borov s firmware, budete mo??no musie?? nastavi?? spr??vcu bal??kov tak, aby zah????al sekcie arch??vu bal??kov contrib a non-free.

source: Boot loader configuration must be updated
sk: Nastavenie zav??dza??a mus?? by?? aktualizovan??

source: Kernel packages no longer update a default boot loader. You should remove 'do_bootloader = yes' from /etc/kernel-img.conf.
sk: Bal??ky jadra u?? neaktualizuj?? predvolen?? zav??dza??. Odstr????te ???do_bootloader = yes??? z /etc/kernel-img.conf.
